{"pageProps":{"frontmatter":{"title":"The PlanetScale workflow","subtitle":"Use the PlanetScale workflow for branching databases, non-blocking schema changes and more.","banner":"/img/docs/ps-workflow.png"},"headings":[{"depth":2,"value":"Serverless databases"},{"depth":2,"value":"PlanetScale's Data Branching feature"},{"depth":2,"value":"Non-blocking schema changes"},{"depth":2,"value":"Deploy requests"},{"depth":2,"value":"Deploy a schema change"}],"body":{"compiledSource":"var l=Object.defineProperty,d=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var c=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var h=(e,a,t)=>a in e?l(e,a,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[a]=t,o=(e,a)=>{for(var t in a||(a={}))c.call(a,t)&&h(e,t,a[t]);if(s)for(var t of s(a))r.call(a,t)&&h(e,t,a[t]);return e},i=(e,a)=>d(e,u(a));var p=(e,a)=>{var t={};for(var n in e)c.call(e,n)&&a.indexOf(n)<0&&(t[n]=e[n]);if(e!=null&&s)for(var n of s(e))a.indexOf(n)<0&&r.call(e,n)&&(t[n]=e[n]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var n=t,{components:e}=n,a=p(n,[\"components\"]);return mdx(MDXLayout,i(o(o({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h2\",null,\"Serverless databases\"),mdx(\"p\",null,\"PlanetScale databases are designed for developers and developer workflows. Deploy a fully managed database with the reliability of MySQL (our databases run on MySQL 8.0) and the scale of open source Vitess in just ten seconds.\"),mdx(\"p\",null,\"Deploy, branch, and query your database directly from the UI, or download our \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://github.com/planetscale/cli#installation\"}),\"CLI\"),\" and run commands there.\"),mdx(\"p\",null,\"Built-in connection pooling means you\\u2019ll never run into connection limits for your database.\"),mdx(\"h2\",null,\"PlanetScale's Data Branching feature\"),mdx(\"p\",null,\"The PlanetScale Data Branching feature allows you to treat your databases like code by unlocking the ability to branch databases.\"),mdx(\"p\",null,\"PlanetScale provides two types of database branches, \",mdx(\"strong\",{parentName:\"p\"},\"development\"),\" and \",mdx(\"strong\",{parentName:\"p\"},\"production\"),\".\"),mdx(\"p\",null,\"Development branches provide isolated copies of your database schema where you can make changes, experiment, or run CI against. Instantly branch your production database to create a staging environment for testing out your schema changes.\"),mdx(\"p\",null,\"Production branches are highly available databases intended for production traffic. They are protected from direct schema changes by default and include automated daily backups.\"),mdx(\"p\",null,\"Learn more about \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://docs.planetscale.com/concepts/branching\"}),\"branching databases\"),\".\"),mdx(\"h2\",null,\"Non-blocking schema changes\"),mdx(\"p\",null,\"PlanetScale makes it safe to deploy schema changes to production and easy to automate schema management as a part of your CI/CD process. PlanetScale schema changes are applied online and protect against changes that block databases, lock individual tables, or slow down production during the migration.\"),mdx(\"p\",null,\"Use a development branch to apply schema changes and view the schema diff in the UI or the CLI. Once you\\u2019re satisfied with your schema changes, you can open a deploy request.\"),mdx(\"p\",null,\"Learn more about \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://docs.planetscale.com/concepts/nonblocking-schema-changes\"}),\"non-blocking schema changes\"),\".\"),mdx(\"h2\",null,\"Deploy requests\"),mdx(\"p\",null,\"Deploy requests allow you to propose schema changes and get feedback from your team. The deploy requests display DDL statements (CREATE, ALTER, and DROP) for each table changed, with a line-by-line schema diff, making it easy to review the changes.\"),mdx(\"p\",null,\"For example, you can pair deploy requests with GitHub pull requests so that your teammates can review the code and the schema changes in parallel.\"),mdx(\"p\",null,\"PlanetScale also analyzes your schema changes for conflicts when you open a deploy request. It checks against the production schema at the time the branch was created and against the current production schema which may have changed in the interim. This ensures your changes can be deployed safely without impacting production.\"),mdx(\"h2\",null,\"Deploy a schema change\"),mdx(\"p\",null,\"Once a deploy request has been approved, it gets added to the deploy queue. Schema changes are applied to your production database branch in the order in which they are added to the deploy queue.\"),mdx(\"p\",null,\"As a part of the process of adding the schema changes to the deploy queue, PlanetScale analyzes the schema changes in the deploy requests ahead of your deploy request for any potential conflicts. If a conflict exists, your deploy request is rejected from the queue, and you are immediately notified of the conflict. This means you\\u2019ll never wait for your schema change to deploy only to learn that there\\u2019s an unanticipated conflict. This is especially useful if long running schema changes are being applied.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"fields":{"slug":"concepts/planetscale-workflow","lastUpdatedOn":"2021-12-25T02:12:46.743Z"}},"__N_SSG":true}